import os
from dotenv import load_dotenv

load_dotenv()

BOT_TOKEN = os.getenv("BOT_TOKEN")

#Информация по экскурсиям
EXCURSIONS = [
    {
        "id": "pilgrims",
        "title": "Паломники (Храмы и церкви России)",
        "description": (
            "Посещение трёх храмов:\n"
            "✅ Ново-Иерусалимский (Истра)\n"
            "✅ Храм вооружённых сил России (Кубинка)\n"
            "✅ Храм Христа Спасителя (Москва)\n\n"
            "⏰ В каждом храме свободное время 40-60 минут\n"
            "⏰ Выезд в 08:00\n"
            "⏰ Длительность ~4-5 часов\n\n"
            "💵 Стоимость: 4000 ₽/чел."
        ),
        "images": [
            "media/piligrims/5389031389581217457.jpg",
            "media/piligrims/5389031389581217458.jpg",
            "media/piligrims/5389031389581217459.jpg",
            "media/piligrims/5389031389581217460.jpg",
            "media/piligrims/5389031389581217464.jpg",
            "media/piligrims/5389031389581217470.jpg",
            "media/piligrims/5389031389581217472.jpg",
            "media/piligrims/5389031389581217473.jpg",
            "media/piligrims/5389031389581217474.jpg",
            "media/piligrims/5389031389581217475.jpg",
            "media/piligrims/5389031389581217476.jpg",
            "media/piligrims/Изображение PNG 10.png",
        ],
        "start_time": "08:00",
        "price": 4000,
        "prepayment_percent": 30,
        "pickup": {
            "title": "ст. Опалиха (со стороны ЖК Опалиха О3)",
            "address": "Московская обл., Красногорск, станция Опалиха",
            "gis": "https://go.2gis.com/2Q7no"
        },
        "route": [
            {
                "name": "Ново-Иерусалимский монастырь",
                "address": "Московская обл., г. Истра, ул. Советская, 2"
            },
            {
                "name": "Храм Вооружённых сил РФ",
                "address": "Московская обл., Одинцовский г.о., парк Патриот"
            },
            {
                "name": "Храм Христа Спасителя",
                "address": "г. Москва, ул. Волхонка, 15"
            }
        ]
    },
    {
        "id": "new_year",
        "title": "Новый год, 2026",
        "description": (
            "🏮Посещение самых красивых новогодних локаций Москвы для фотосессий 📸:\n"
            "✅ Парад новогодних ёлок у ЦУМа 🎄\n"
            "✅ Большой театр 🏛️\n"
            "✅ Дом графа Шереметьева 🏰\n"
            "✅ Парк Акведук 🎡\n\n"
            "⏰ Выезд в 15:00\n\n "
            "💵 Cтоимость: 3500 ₽/чел"
        ),
        "images": [
            "media/new_year/5389031389581217210.jpg",
            "media/new_year/5389031389581217212.jpg",
            "media/new_year/5389031389581217213.jpg",
            "media/new_year/5389031389581217214.jpg",
            "media/new_year/5389031389581217215.jpg",
            "media/new_year/5389031389581217216.jpg",
            "media/new_year/5389031389581217217.jpg",
            "media/new_year/5389031389581217218.jpg",
            "media/new_year/5389031389581217226.jpg",
            "media/new_year/5389031389581217229.jpg",
        ],
        "start_time": "15:00",
        "price": 3500,
        "prepayment_percent": 30,
        "pickup": {
            "title": "ст. Опалиха (со стороны ЖК Опалиха О3)",
            "address": "Московская обл., Красногорск, станция Опалиха",
            "gis": "https://go.2gis.com/2Q7no"
        },
        "route": [
            {
                "name": "Парад новогодних ёлок у ЦУМа",
                "address": "г. Москва, ул. Петровка, 2"
            },
            {
                "name": "Большой театр",
                "address": "г. Москва, Театральная площадь, 1"
            },
            {
                "name": "Дом графа Шереметьева",
                "address": "г. Москва, Романов переулок, 2"
            },
            {
                "name": "Парк Акведук",
                "address": "г. Москва, ул. Малахитовая"
            }
        ]
    }
]